app/controllers/students_controller.rb

  def update
    student = Student.find_by(id: params[:id])
    student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "fdf"], ["updated_at", "2021-07-06 05:51:21.800599"], ["id", 4]]

  def edit
    @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]